# Student Data
This notebook analyizes pass / fail data for a class

In [1]:
#grades for 12 students
data = [50, 55, 68, 98, 3, 24, 85, 91, 93, 45, 72, 88]

In [2]:
#import numpy to create array
import numpy as np

grades = np.array(data)
print(grades)

[50 55 68 98  3 24 85 91 93 45 72 88]

In [3]:
#show the shape of the array
grades.shape

(12,)

In [4]:
#show the 9th value in the array
grades[9]

np.int64(45)

In [5]:
#show the mean of the array
grades.mean()

np.float64(64.33333333333333)

In [6]:
#determine hours studied for 12 students, creat array with 2 arrays inside
study_hours = [11, 2, 4, 6, 20, 1, 15, 3, 7, 11, 6, 8]

student_data = np.array([study_hours, grades])

In [7]:
#calculate mean of study time and grades
avg_study = student_data[0].mean()
avg_grade = student_data[1].mean()

print(f'Avg Study Time: {avg_study}\nAvg Grade: {avg_grade}')

Avg Study Time: 7.833333333333333
Avg Grade: 64.33333333333333

In [8]:
#import pandas
import pandas as pd

In [9]:
#create data frame for pandas
df_students = pd.DataFrame({'Name': ['Mike', 'Dan', 'Jim', 'Melissa', 'Brad', 'Tia', 'Chad', 'Colin', 'Melody', 'Kim', 'Tina', 'Gladys'],
                            'StudyHours': student_data[0],
                            'Grade': student_data[1]})

df_students

       Name  StudyHours  Grade
0      Mike          11     50
1       Dan           2     55
2       Jim           4     68
3   Melissa           6     98
4      Brad          20      3
5       Tia           1     24
6      Chad          15     85
7     Colin           3     91
8    Melody           7     93
9       Kim          11     45
10     Tina           6     72
11   Gladys           8     88

In [10]:
#choose first record information
df_students.loc[7]

Name          Colin
StudyHours        3
Grade            91
Name: 7, dtype: object

In [11]:
#query a record
df_students.query('Name =="Tia"')

  Name  StudyHours  Grade
5  Tia           1     24

In [12]:
#additional method to get record
df_students[df_students.Name=='Tia']

  Name  StudyHours  Grade
5  Tia           1     24

## Import and explore dataset